sesion04/misuperblog/app/controllers/comments_controller.rb

SELECT * FROM `comments`
---
  def index
    @comments = Comment.all

SELECT * FROM `comments` WHERE (`comments`.`id` = 1)
---
  def show
    @comment = Comment.find(params[:id])

SELECT * FROM `comments` WHERE (`comments`.`id` = 3)
---
  def edit
    @comment = Comment.find(params[:id])

INSERT INTO `comments` (`name`, `created_at`, `updated_at`, `post_id`, `content`, `email`) VALUES('Alvaro', '2010-04-21 01:51:21', '2010-04-21 01:51:21', 1, 'Esto es genial!', 'alvaro@xendacentral.com')
---
  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save

SELECT * FROM `comments` WHERE (`comments`.`id` = 3)
UPDATE `comments` SET `updated_at` = '2010-04-21 01:56:48', `post_id` = 1 WHERE `id` = 3
---
  def update
    @comment = Comment.find(params[:id])

    respond_to do |format|
      if @comment.update_attributes(params[:comment])