sesion04/misuperblog/app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`created_at`, `title`, `updated_at`, `content`) VALUES('2010-04-21 01:07:26', 'Mi nuevo post', '2010-04-21 01:07:26', 'Un super texto largo e interesante')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `content` = 'Un super texto largo e interesante.\r\nEs demasiado genial. ', `updated_at` = '2010-04-21 01:32:50' WHERE `id` = 1